InformationRegisters/ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПоставляемыеДанныеКлассификаторовВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоставляемыеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмеютсяНезагруженныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоставляемыеДанныеКлассификаторовВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоставляемыеДанныеКлассификаторовВидовПродукцииИС(Идентификатор, Версия, Адрес, ЗагруженЧастично) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПолноеИмя());

	НачатьТранзакцию();

	Попытка

		Блокировка.Заблокировать();
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		
		НаборЗаписей = СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);

		НоваяЗапись = НаборЗаписей.Добавить();

		НоваяЗапись.Идентификатор              = Идентификатор;
		НоваяЗапись.Версия                     = Версия;
		НоваяЗапись.ПоставляемыеДанные         = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		НоваяЗапись.ИмеютсяНезагруженныеДанные = ЗагруженЧастично;

		НаборЗаписей.Записать();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

Функция СохраненныеДанныеКлассификаторовВидовПродукцииИС(Идентификатор, СЧастичнойЗагрузкой=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Адрес             = Неопределено;
	СохраненнаяВерсия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПоставляемыеДанные,
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ИмеютсяНезагруженныеДанные
			|ИЗ
			|	РегистрСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС КАК
			|		ПоставляемыеДанныеКлассификаторовВидовПродукцииИС
			|ГДЕ
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.Идентификатор = &Идентификатор";
		
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СЧастичнойЗагрузкой И Не ВыборкаДетальныеЗаписи.ИмеютсяНезагруженныеДанные Тогда
			Продолжить;
		КонецЕсли;
		СохраненнаяВерсия = ВыборкаДетальныеЗаписи.ПоставляемыеДанные.Получить();
	КонецЦикла;
	
	Если СохраненнаяВерсия <> Неопределено Тогда
		Адрес = ПоместитьВоВременноеХранилище(СохраненнаяВерсия);
	КонецЕсли;
	
	Возврат Адрес;	
	
КонецФункции

Функция ИмеютсяСохраненныеДанныеКлассификатораВидовПродукцииИС(Идентификатор, СЧастичнойЗагрузкой=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмеютсяСохраненныеДанные = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПоставляемыеДанные,
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ИмеютсяНезагруженныеДанные
			|ИЗ
			|	РегистрСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС КАК
			|		ПоставляемыеДанныеКлассификаторовВидовПродукцииИС
			|ГДЕ
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.Идентификатор = &Идентификатор";
		
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СЧастичнойЗагрузкой И Не ВыборкаДетальныеЗаписи.ИмеютсяНезагруженныеДанные Тогда
			Продолжить;
		КонецЕсли;
		ИмеютсяСохраненныеДанные = Истина;
	КонецЦикла;
	
	Возврат ИмеютсяСохраненныеДанные;	
	
КонецФункции

Процедура ОбновитьПризнакЧастичнойЗагрузкиКлассификаторовВидовПродукцииИС(Идентификатор, ЗагруженЧастично) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПолноеИмя());

	НачатьТранзакцию();

	Попытка

		Блокировка.Заблокировать();
		
		СуществующаяЗапись = СоздатьМенеджерЗаписи();
		СуществующаяЗапись.Идентификатор = Идентификатор;
		
		СуществующаяЗапись.Прочитать();
		
		Если СуществующаяЗапись.Выбран() Тогда
			СуществующаяЗапись.ИмеютсяНезагруженныеДанные = ЗагруженЧастично;
			СуществующаяЗапись.Записать();
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
